-- SELECT LS.Номер as "Номер", ROUND(SUM(NS.[Сумма]), 2) as "Сумма",
--     CASE 
--         WHEN O.ИНН = '3444259579' THEN 'КТ'
--         WHEN O.ИНН = '3460019060' THEN 'КВ'
--     END AS 'Наименование'
-- FROM [НСальдо] NS
-- JOIN [Лицевые счета] LS ON LS.ROW_ID = NS.[Счет]
-- JOIN [Организации] O ON O.ROW_ID = NS.Поставщик
-- WHERE NS.[Месяц расчета] = '2024-10-01' AND NS.[Месяц долга] = '2024-10-01' and NS.[Сумма] > 0
-- AND O.ИНН ='3444259579'
-- GROUP BY LS.Номер, O.ИНН
-- ORDER BY LS.Номер

-- SELECT LS.Номер as "Номер", ROUND(SUM(NS.[Сумма]), 2) as "Сумма", O.Наименование
-- FROM [НСальдо] NS
-- JOIN [Лицевые счета] LS ON LS.ROW_ID = NS.[Счет]
-- JOIN [Организации] O ON O.ROW_ID = NS.Поставщик
-- WHERE NS.[Месяц расчета] = '2024-10-01' AND NS.[Месяц долга] = '2024-10-01' and NS.[Сумма] > 0
-- AND O.ИНН ='3444259579' AND O.ROW_ID IN (SELECT KO.[Категории-Организация] FROM [Категории организаций] KO WHERE KO.[Категории организаций] = 7036)
-- GROUP BY LS.Номер, O.Наименование
-- ORDER BY LS.Номер

SELECT ROUND(SUM(NS.[Сумма]), 2) as "Сумма", LS.Номер, KR.[Счет-Наниматель], NS.[Месяц долга], O.Наименование, O.ROW_ID, KR.ФИО, KR.[Дата рождения], KR.[Дата смерти]
FROM [НСальдо] NS
JOIN [Лицевые счета] LS ON LS.ROW_ID = NS.[Счет]
JOIN [Организации] O ON O.ROW_ID = NS.Поставщик
JOIN [Карточки регистрации] KR ON KR.ROW_ID = LS.[Счет-Наниматель]
WHERE NS.[Месяц расчета] = '2024-10-01' AND NS.[Месяц долга] >= '2024-10-01' and NS.[Сумма] > 0
AND O.ИНН ='3444259579' 
AND O.ROW_ID IN (SELECT KO.[Категории-Организация] FROM [Категории организаций] KO WHERE KO.[Категории организаций] IN (7036, 7034))
GROUP BY LS.Номер, KR.[Счет-Наниматель], NS.[Месяц долга], O.Наименование, O.ROW_ID, KR.ФИО, KR.[Дата рождения], KR.[Дата смерти]

-- КТ
-- Остальное
SELECT * FROM [Категории организаций] KO
WHERE KO.[Категории организаций] = 7036

-- КТ
-- Остальное
SELECT * FROM [Категории организаций] KO
WHERE KO.[Категории организаций] = 7034

-- КВ
-- Остальное
SELECT * FROM [Категории организаций] KO
WHERE KO.[Категории организаций] = 7015

-- КИ
-- Остальное
SELECT * FROM [Категории организаций] KO
WHERE KO.[Категории организаций] = 7013