----------------1 вариант
drop table if EXISTS #temp 

SELECT DF.*, VZ.ROW_ID as 'ROW_ID_Взыскания', VZ.Номер, CONCAT(VF.Название, ' ', SF.Имя) as 'Фаза + Состояние' 
into #temp
FROM [Взыскание задолженности] VZ
JOIN [Состояние документа] SD ON VZ.[Документ-Фаза] = SD.ROW_ID
JOIN [Виды фаз] VF ON SD.[Фаза-Состояние] = VF.ROW_ID
LEFT JOIN [Состояния фаз] SF ON SD.[ПодФаза-Состояние] = SF.ROW_ID
JOIN [Держатели долга] DD ON VZ.[Держатели долга-Взыскания] = DD.ROW_ID
JOIN [Организации] O ON DD.[Держатели-Организация] = O.ROW_ID
JOIN (SELECT ROUND(SUM(NS.[Сумма]), 2) as "Сумма", LS.Номер as 'Номер ЛЦ', KR.[Счет-Наниматель], NS.[Месяц долга], O.Наименование,
        O.ROW_ID as 'ROW_ID_Организации', KR.ФИО, KR.[Дата рождения], KR.[Дата смерти], NS.Счет
    FROM [НСальдо] NS
    JOIN [Лицевые счета] LS ON LS.ROW_ID = NS.[Счет]
    JOIN [Организации] O ON O.ROW_ID = NS.Поставщик
    JOIN [Карточки регистрации] KR ON KR.ROW_ID = LS.[Счет-Наниматель]
    WHERE NS.[Месяц расчета] = '2025-02-01' AND NS.[Месяц долга] < '2025-02-01' and NS.[Сумма] > 0
    AND O.ИНН ='3444259579' AND O.ROW_ID IN (SELECT KO.[Категории-Организация] FROM [Категории организаций] KO WHERE KO.[Категории организаций] IN (7036, 7034))
    GROUP BY LS.Номер, KR.[Счет-Наниматель], NS.[Месяц долга], O.Наименование, O.ROW_ID, KR.ФИО, KR.[Дата рождения], KR.[Дата смерти], NS.Счет) AS DF ON DF.Счет = VZ.[Счет-Взыскания]
WHERE O.ИНН ='3444259579'
AND O.ROW_ID IN (SELECT KO.[Категории-Организация] FROM [Категории организаций] KO WHERE KO.[Категории организаций] IN (7036, 7034))

select ns.* into #saldo 
from НСальдо ns 
JOIN stack.[УК договоры] uk ON ns.ДоговорУК = uk.ROW_ID
JOIN stack.[Организации] org ON uk.[Организация-УКДоговор] = org.ROW_ID
WHERE ns.[Месяц долга] < '2025-02-01' and ns.[Месяц расчета] = '2025-02-01' AND org.ИНН = '3444259579'

--------------2 вариант
--drop table if EXISTS #temp

SELECT ROUND(SUM(NS.[Сумма]), 2) as "Сумма", LS.Номер as 'Номер ЛЦ', KR.[Счет-Наниматель], NS.[Месяц долга],
        O.Наименование, O.ROW_ID as 'ROW_ID_Организации', KR.ФИО, KR.[Дата рождения],
        KR.[Дата смерти], FZ.ROW_ID_Взыскания, FZ.Фаза, FZ.[Дата постановки на фазу], FZ.ДатНачДолга, FZ.ДатКнцДолга, FZ.НомерДела
--into #temp
FROM НСальдо NS
JOIN [Лицевые счета] LS ON LS.ROW_ID = NS.[Счет]
JOIN [Организации] O ON NS.Поставщик = O.ROW_ID
LEFT JOIN [Карточки регистрации] KR ON KR.ROW_ID = LS.[Счет-Наниматель]
LEFT JOIN (
    SELECT VZ.ROW_ID as 'ROW_ID_Взыскания', VZ.Номер AS НомерДела, (VF.Название + ' ' + ISNULL(SF.Имя, '')) as 'Фаза',
        VZ.[Счет-Взыскания], VZ.ДатНачДолга, VZ.ДатКнцДолга,
        SD.ДатНач AS [Дата постановки на фазу]
    FROM [Взыскание задолженности] VZ
    JOIN [Держатели долга] DD ON VZ.[Держатели долга-Взыскания] = DD.ROW_ID
    JOIN [Организации] O ON DD.[Держатели-Организация] = O.ROW_ID
    JOIN [Состояние документа] SD ON VZ.[Документ-Фаза] = SD.ROW_ID
    JOIN [Виды фаз] VF ON SD.[Фаза-Состояние] = VF.ROW_ID
    JOIN [Категории организаций] KO ON KO.[Категории-Организация] = O.ROW_ID
    LEFT JOIN [Состояния фаз] SF ON SD.[ПодФаза-Состояние] = SF.ROW_ID
    WHERE 
        O.ИНН ='3444259579'
        AND KO.[Категории организаций] IN (7036, 7034)
) FZ ON NS.Счет = FZ.[Счет-Взыскания] AND NS.[Месяц долга] BETWEEN FZ.ДатНачДолга AND FZ.ДатКнцДолга
WHERE 
    NS.[Месяц расчета] = '2025-02-01' 
    AND NS.[Месяц долга] < '2025-02-01' and NS.[Сумма] > 0
    AND O.ИНН ='3444259579'
    AND O.ROW_ID IN (SELECT KO.[Категории-Организация] FROM [Категории организаций] KO WHERE KO.[Категории организаций] IN (7036, 7034))
GROUP BY LS.Номер, KR.[Счет-Наниматель], NS.[Месяц долга], O.Наименование, O.ROW_ID, KR.ФИО, KR.[Дата рождения],
    KR.[Дата смерти], FZ.ROW_ID_Взыскания, FZ.Фаза, FZ.[Дата постановки на фазу], FZ.ДатНачДолга, FZ.ДатКнцДолга, FZ.НомерДела

--Мунжилье
SELECT T.* FROM Реестры R 
JOIN #temp T ON T.[Номер ЛЦ] = R.[Реестры_состав-Лицевой]
JOIN [Категории организаций] KO ON KO.[Категории-Организация] = T.ROW_ID_Организации
WHERE R.Папки = 35700042 AND KO.[Категории организаций] = 7036

--Остальное 
SELECT T.* FROM #temp T
JOIN [Категории организаций] KO ON KO.[Категории-Организация] = T.ROW_ID_Организации
WHERE KO.[Категории организаций] = 7036 and T.[Счет-Наниматель] NOT IN (SELECT R.[Реестры_состав-Лицевой] FROM Реестры R WHERE R.Папки = 35700042)

--Цессии
SELECT T.* FROM #temp T
JOIN [Категории организаций] KO ON KO.[Категории-Организация] = T.ROW_ID_Организации
WHERE KO.[Категории организаций] = 7034 

SELECT T.* FROM #temp T
JOIN [Категории организаций] KO ON KO.[Категории-Организация] = T.ROW_ID_Организации
WHERE KO.[Категории организаций] = 7034  and T.[Счет-Наниматель] IN (SELECT R.[Реестры_состав-Лицевой] FROM Реестры R WHERE R.Папки = 35700042)